In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import inspect
from login import uname, pw

In [2]:
interest_file  = "Resources/interest.csv"
interest_df = pd.read_csv(interest_file,encoding='cp1252',skiprows=[0,2,3,4,5,6,7,8,9,10])
interest_df.head()

,Title,Cash Rate Target,Interbank Overnight Cash Rate,Highest Interbank Overnight Cash Rate,Lowest Interbank Overnight Cash Rate,Volume of Cash Market Transactions,Number of Cash Market Transactions,1-month BABs/NCDs,3-month BABs/NCDs,6-month BABs/NCDs,...,3-month OIS,6-month OIS,1-month Treasury Note,3- month Treasury Note,6- month Treasury Note,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20
0,Jun-1969,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.9,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Jul-1969,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.8,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Aug-1969,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6.1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Sep-1969,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.8,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Oct-1969,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.6,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
interest_new_data_df = interest_df[['Title', 'Cash Rate Target', 'Interbank Overnight Cash Rate','1-month BABs/NCDs','3-month BABs/NCDs','6-month BABs/NCDs']].copy()
interest_new_data_df = interest_new_data_df.rename(columns={'Title':'date','Cash Rate Target':'cash_rate_target','Interbank Overnight Cash Rate':'overnight_cash_rate','1-month BABs/NCDs':'monthly_BABS','3-month BABs/NCDs':'quar_BABS','6-month BABs/NCDs':'year_end_BABS'})
interest_new_data_df.head()

,date,cash_rate_target,overnight_cash_rate,monthly_BABS,quar_BABS,year_end_BABS
0,Jun-1969,NaN,NaN,NaN,5.9,NaN
1,Jul-1969,NaN,NaN,NaN,5.8,NaN
2,Aug-1969,NaN,NaN,NaN,6.1,NaN
3,Sep-1969,NaN,NaN,NaN,5.8,NaN
4,Oct-1969,NaN,NaN,NaN,5.6,NaN

In [4]:
interest_new_data_df['date']= pd.to_datetime(interest_new_data_df['date'])

In [5]:
interest_new_data_df['quarter']= pd.PeriodIndex(interest_new_data_df.date, freq ='Q')
interest_new_data_df

,date,cash_rate_target,overnight_cash_rate,monthly_BABS,quar_BABS,year_end_BABS,quarter
0,1969-06-01,NaN,NaN,NaN,5.9,NaN,1969Q2
1,1969-07-01,NaN,NaN,NaN,5.8,NaN,1969Q3
2,1969-08-01,NaN,NaN,NaN,6.1,NaN,1969Q3
3,1969-09-01,NaN,NaN,NaN,5.8,NaN,1969Q3
4,1969-10-01,NaN,NaN,NaN,5.6,NaN,1969Q4
...,...,...,...,...,...,...,...
701,NaT,NaN,NaN,NaN,NaN,NaN,NaT
702,NaT,NaN,NaN,NaN,NaN,NaN,NaT
703,NaT,NaN,NaN,NaN,NaN,NaN,NaT
704,NaT,NaN,NaN,NaN,NaN,NaN,NaT
705,NaT,NaN,NaN,NaN,NaN,NaN,NaT

In [6]:
interest_new_data_df['quarter']=interest_new_data_df['quarter'].astype(str)

In [7]:
interest_new_data_df.dropna(inplace=True)
interest_new_data_df

,date,cash_rate_target,overnight_cash_rate,monthly_BABS,quar_BABS,year_end_BABS,quarter
277,1992-07-01,5.91,5.93,5.84,5.64,5.50,1992Q3
278,1992-08-01,5.75,5.86,5.88,5.73,5.66,1992Q3
279,1992-09-01,5.75,5.74,5.91,5.94,5.99,1992Q3
280,1992-10-01,5.75,5.74,5.86,5.86,5.88,1992Q4
281,1992-11-01,5.75,5.77,5.88,5.88,5.92,1992Q4
...,...,...,...,...,...,...,...
635,2022-05-01,0.33,0.29,0.39,1.00,1.79,2022Q2
636,2022-06-01,0.73,0.69,0.92,1.60,2.48,2022Q2
637,2022-07-01,1.28,1.24,1.48,2.07,2.87,2022Q3
638,2022-08-01,1.81,1.77,1.89,2.31,2.92,2022Q3
639,2022-09-01,2.25,2.21,2.41,2.76,3.26,2022Q3

In [23]:
quarter_means = interest_new_data_df.groupby('quarter').mean()
quarter_means = quarter_means.round(2)

In [24]:
quarter_means.info()

<class 'pandas.core.frame.DataFrame'>
Index: 121 entries, 1992Q3 to 2022Q3
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   cash_rate_target     121 non-null    float64
 1   overnight_cash_rate  121 non-null    float64
 2   monthly_BABS         121 non-null    float64
 3   quar_BABS            121 non-null    float64
 4   year_end_BABS        121 non-null    float64
dtypes: float64(5)
memory usage: 5.7+ KB

In [25]:
protocol = 'postgresql'
host = 'localhost'
port = 5432
database_name = 'project2_db'
rds_connection_string = f'{protocol}://{uname}:{pw}@{host}:{port}/{database_name}'
print(rds_connection_string)
engine = create_engine(rds_connection_string)
insp = inspect(engine)

postgresql://postgres:work98@localhost:5432/project2_db

In [26]:
quarter_means.to_sql(name='interest', con=engine, if_exists='replace', index=True)

In [27]:
pd.read_sql_query('select * from interest', con=engine).head()

,quarter,cash_rate_target,overnight_cash_rate,monthly_BABS,quar_BABS,year_end_BABS
0,1992Q3,5.80,5.84,5.88,5.77,5.72
1,1992Q4,5.75,5.77,5.87,5.88,5.91
2,1993Q1,5.70,5.70,5.72,5.69,5.69
3,1993Q2,5.25,5.26,5.27,5.21,5.17
4,1993Q3,4.91,4.91,4.95,4.90,4.85